# IsPlaceholder Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Pipe..::..IsPlaceholder Property
Pipe Class See Also
---
Identifies if the pipe is a placeholder or not.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsPlaceholder { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPlaceholder As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPlaceholder {
	bool get ();
}
```

# See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace